saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32F2xx_DFP.2.9.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32F2xx_DFP</name>
  <description>STMicroelectronics STM32F2 Series Device Support, Drivers and Examples</description>
  <url>http://www.keil.com/pack</url>

  <releases>
    <release version="2.9.0" date="2018-04-03">
      Increased stm32f2xx_hal_conf.h version to 1.2.1. 
      CMSIS-Driver:
      - Added support for Arm Compiler 6.
      - CAN:
      -- Corrected abort message send functionality.
      - SPI:
      -- Made I/O speed configurable.
      -- Corrected data shift register overrun in master mode.
      - USART:
      -- Made I/O speed configurable.
      Board Examples:
      - Updated all examples:
      -- Placing Event Recorder into non-initialized memory area.
      -- Using ARM.CMSIS-Driver.2.2.0.pack and ARM.CMSIS.5.3.0.pack.
      - Added Network SNMP_Agent example.
    </release>
    <release version="2.8.0" date="2018-02-22">
      Updated Pack to STM32Cube_FW_F2 Firmware Package version V1.7.0.
      - Reduced overall pack size by extracting only 'Drivers', 'Documentation' and 'Fonts' from Firmware Library pack.
      - Updated HAL to version V1.2.1.
      - Patching file: stm32f2xx_hal_def.h to support ARM Compiler 6.
      Device Support:
      - Added DBGMCU INI and DBGCONF files.
      - Removed reference to DBGMCU INI files from component startup.
      CMSIS-Driver:
      - CAN:
      -- Corrected comment and code for CubeMX CAN interrupts settings (should be disabled).
      -- Corrected SetBitrate function.
      - EMAC:
      -- Corrected transmit checksum offload for IPv4 fragmented packets.
      - USART:
      -- Corrected ARM_USART_SET_IRDA_PULSE control.
      - USB Device:
      -- Removed CMSIS-RTOS dependency.
      -- Corrected high-bandwidth isochronous endpoint functionality.
      - USB Host:
      -- HS driver: On-chip PHY powered down if external ULPI PHY is used.
      -- Removed CMSIS-RTOS dependency.
      Board Examples:
      - Added USB Device WinUSB_Echo examples.
      - Updated all examples adding release and debug targets, using CMSIS-RTOS2 RTX and enabling the Event Recorder in debug targets.
      - Updated emWin examples to emWin V5.46e.
      - Updated USB Host examples thread stack settings.
      - Updated Board Support LED_*.c files.
      - Removed MCBSTM32F200 board Network examples based on legacy Network API v6.
    </release>
    <release version="2.7.0" date="2017-06-01">
      Based on STMicroelectronics STM32CubeF2 Firmware Package to Version 1.3.0.
      Updated CMSIS drivers:
      - USART: Added "Not Used" support for TX and RX pins
      - SPI:   Added "Not Used" support for MISO and MOSI pins
      - CAN:
      -- Corrected filter setting for adding/removing maskable Standard ID
      -- Corrected clearing of overrun flag in interrupt routine
      -- Corrected CAN2 initialization that was disabling CAN1 filters
      -- Corrected receive overrun signaling
      - I2C:
      -- slave event handling reworked
      -- Corrected rise time setting when using ARM_I2C_BUS_SPEED_FAST
      - USB Device:
      -- HS driver: On-chip PHY powered down if external ULPI PHY is used
      -- Corrected resume event signaling
      -- VBUS sensing enabled by default
      -- VBUS detection is selected automatically based on VBUS sensing pin setting (in RTE_Device.h or by STM32CubeMX)
      -- Corrected initial resume signaling after USB Bus Reset
      -- Corrected device status information
      - USB Host:
      -- HS driver: On-chip PHY powered down if external ULPI PHY is used
      -- Corrected over-current pin configuration
      Updated BSP drivers:
      - Board Touch display: MCBSTM32F200 Touch_STMPE811.c: Corrected occasional incorrect coordinate reading, when touch screen is released.
      Updated examples:
      - Updated emWin examples to emWin V5.36f
      - Updated USB Device CDC ACM VirtualCOM example (corrected initial UART receive size)
      Updated RTE_Device:
      - Added "Not Used" support for SPI MOSI/MISO pins and USART TX/RX pins.
    </release>
    <release version="2.6.0" date="2016-04-14">
      Updated CMSIS drivers:
      - EMAC:
      -- Corrected Ethernet PTP functionality
      - CAN:
      -- Corrected functionality when only one CAN controller is used
      -- Corrected functionality when NULL pointer is provided for one or both signal callbacks in Initialize function call
      - USB Host full-speed:
      -- Removed interrupt priority handling
      - USB Host high-speed:
      -- Added DMA configuration to RTE_Device.h
      -- Corrected wrong result of PipeTransferGetResult for In Pipe transfers in DMA mode
      -- Added check to PipeTransfer function for 4-byte data alignment if DMA is used
      -- Removed interrupt priority handling
      - USART:
      -- Corrected CTS handling and added signal CTS change event.
      Updated examples:
      - Updated emWin examples to emWin V5.32
      - Updated CAN example
      - Updated USB Host examples
      - Updated USB Device CDC ACM VirtualCOM example for Keil MCBSTM32F200 evaluation board
    </release>
    <release version="2.5.0" date="2015-12-08">
      Updated STMicroelectronics STM32CubeF2 Firmware Package to Version 1.3.0.
      - updated affected examples
      MDK-ARM configuration via STM32CubeMX:
      - updated MX_Device.h generation: pin names characters '/', '-', ' ' converted to '_'
      Added examples using Network DualStack (IPv4/IPv6) Middleware targeting MCBSTM32F200 (Keil.MDK-Middleware.7.0.0.pack required)
      Updated all CMSIS drivers:
      - Corrected PowerControl function for Unconditional Power Off
      Updated USB Device CMSIS driver:
      - Updated handling of Isochronous transfer
      Updated USB Host CMSIS drivers:
      - Corrected speed setting in high-speed port for On-chip Full-speed PHY
      - Corrected low-speed device on high-speed port functionality
      - Corrected multiple packet sending and PING functionality
      - Renamed defines for overriding the maximum number of pipes used
      from USBH_MAX_PIPE_NUM to USBH0_MAX_PIPE_NUM in full-speed driver, and
      from USBH_MAX_PIPE_NUM to USBH1_MAX_PIPE_NUM for high-speed driver
      Corrected SPI driver:
      - Corrected 8bit/16bit Data register access, regarding the Data frame size
      Updated CAN driver:
      - added possibility to use only CAN1
      Updated EMAC driver:
      - corrected return value of the ReadFrame function
    </release>
    <release version="2.4.0" date="2015-09-16">
      Introducing MDK-ARM configuration via STM32CubeMX:
      - see documentation for component Device:STM32CubeFramework:STM32CubeMX
      CMSIS driver:
      - added CAN driver and configuration options in RTE_Device.h
      - updated EMAC driver: corrected lockup after long runtime
      - updated MCI driver: corrected clock divider bypass handling
      - updated USART driver: corrected driver incorrectly stopped receiving data when calling the USART_Receive function while the receiver is busy
      - update I2C driver: corrected 3 byte reception and POS bit handling in master mode as well as corrected acknowledge handling in slave mode
      MDK example projects:
      - added examples created using MDK and STM32CubeMX: Blinky and emWin GUI_VNC for Keil MCBSTM32F200
      - added CAN Data and RTR projects for Keil MCBSTM32F200
      - updated FTP_Server example: Heap memory increased
    </release>
    <release version="2.3.0" date="2015-06-12">
      Updated CMSIS drivers:
      - I2C, MCI, EMAC, USB Device, USB Host: Updated initialization, uninitialization and power procedures
      - MCI: Corrected data timeout handling
      - SPI:
      -- Corrected status bit-field handling, to prevent race conditions
      -- Corrected ARM_SPI_EVENT_DATA_LOST event generation in master mode at high bus speeds
      -- Corrected bus speed configuration
      - USART:
      -- Corrected status bit-field handling, to prevent race conditions
      -- Added RX TimeOut handling
      - USB Device: Corrected transferred size during transfer
      - USB Host:
      -- Added pipe bus error signaling of active pipes on port disconnect
      -- Corrected handling on error transfers
      Updated MDK examples:
      - Boards/Keil/MCBSTM32F200/Blinky
      - USB Device Mass Storage Example
    </release>
    <release version="2.2.0" date="2015-03-20">
      Required PACKs: ARM.CMSIS.4.3.0.pack, Keil.MDK-Middleware.6.3.0.pack, Keil.ARM_Compiler.1.0.0.pack
      Updated drivers:
      - USB Host: Corrected signalling of STALL handshake
      - USB Device:
      -- Corrected IN ZLP sending
      -- VBUS sensing disabled if ARM_USBD_VBUS_DETECT is not enabled
      - USART: corrected when configured via STM32CubeMX
      - I2C:
      -- includes corrected when configured with STM32CubeMX
      -- corrected transfer issues after ARM_I2C_EVENT_ADDRESS_NACK
      - MCI:
      -- includes corrected when configured with STM32CubeMX
      -- correction required due to device errata
      -- added support for SD high speed bus mode
      - SPI: corrected spi->info->mode handling
      Updated examples:
      - Compiler I/O software component is now used for I/O retargeting
      - Updated Network examples for MCBSTM32F200 V1.2 board with KSZ8081RNA Ethernet PHY
      Updated dependencies:
      - Ethernet does not require CMSIS:RTOS
    </release>
    <release version="2.1.0" date="2014-12-11">
      Updated drivers:
      - I2C: corrected slave mode and 10-bit addressing mode, I2C2 SDA pin configuration
      - USB Host:
      -- corrected interrupt pipe behaviour, and PING on high-speed driver, init/deinit and power control
      -- added VBUS Power pin active high/low functionality, overcurrent state functionality (without event) added
      - USB Device: prevent simultaneous IN writes to FIFO
      - USART and SPI: corrected DMA transfer abort
      - MCI: corrected setting of bus width
      - EMAC: implemented function 'GetMacAddress'
      - EMAC, I2C, MCI, USART, SPI and USBD: corrected some basic MISRA 2004 compliances like signedness, boolean operation on logical operators
      Updated RTE_Device.h: added Receive and transmit DMA configuration for SDIO peripheral
      Renamed SDIO component in 'Device::STM32Cube HAL' to 'SD' to match HAL component name
      Updated examples:
      - File_Demo and USB Host MassStorage examples updated due to the new fdelete() API in File System Version 6.2
      - MCBSTM32F200 USB Host Keyboard example (removed USB High-speed usage)
      - updated RTE_Device.h to version 2.01
    </release>
    <release version="2.0.0" date="2014-10-16">
      PACK based on STMicroelectronics STM32CubeF2 Firmware Package V1.1.0
      - STD Peripheral Library components removed
      New Device variants introduced matching ST Cube device database
      - e.g. STM32F207IG -> STM32F207IGHx or STM32F207IGTx
      CMSIS Drivers Version 2 (changed Cclass "Drivers" to "CMSIS Driver")
      - Ethernet MAC, I2C, MCI, SPI, USART, USB Device, USB Host
      MDK-ARM Example projects require MDK-Middleware 6.1.1 and CMSIS 4.2.0
      - Board Support uses Board Interface API from MDK-Middleware (header file names changed)
      - Board: Keil MCBSTM32F200
    </release>
    <release version="1.0.8">
      Device: Startup files for GCC added, conditions extended to reflect toolchain dependencies
    </release>
    <release version="1.0.7" date="2014-04-29">
      Updated I2C driver  (BUG Fix: 2 byte reception)
      Device:StdPeriph Drivers:Framework Version:1.1.1 - added file misc.c
    </release>
    <release version="1.0.6">
      Added STM Peripheral Driver Library V1.1.0
    </release>
    <release version="1.0.5">
      Updated I2c driver (corrected register access)
      USB Device drivers update: multiple packet read, EP0 unconfiguration
      Updated SPI driver (IRQ handling corrected)
    </release>
    <release version="1.0.4">
      Updated drivers (namespace prefix ARM_ added)
    </release>
    <release version="1.0.3">
      Added STM32F200 Board Support Bundle
    </release>
    <release version="1.0.2">
      Added emWin Example and GUIDemo for MCBSTM32F200
      Added emWin LCD driver for MCBSTM32F200
      Updated USBH Drivers (improved robustness)
    </release>
    <release version="1.0.1">
      Generic Drivers moved to "Drivers" Class
      Added UART and I2C Driver
      Updated USBD and USBH Drivers
      Added MCBSTM32F200 Demo example
      Added MCBSTM32F200 USB Host Keyboard example
      Added MCBSTM32F200 BSP Drivers: Joystick, Touchscreen, Accelerometer, Gyroscope, Camera
      Updated MCBSTM32F200 BSP Driver: Keyboard
      Updated all MCBSTM32F200 examples
      Minor corrections:
      - SPI Driver
      - DMA Driver
      - MCI Driver
    </release>
    <release version="1.0.0">
      First Release version of STM32F2 Device Family Pack.
    </release>
    <release version="0.9.0">
      Beta version of STM32F2 Device Family Pack.
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F2</keyword>
    <keyword>STM32F2xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32F2 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>

      <book name="Documentation/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>

      <description>
The STM32F2 family incorporates high-speed embedded memories and an extensive range of enhanced I/Os and peripherals connected to two APB buses, three AHB buses and a 32-bit multi-AHB bus matrix.
Typical applications include Motor drive and application control Medical equipment, Industrial applications: PLC, inverters, circuit breakers, Printers and scanners, Alarm systems, video intercom, and HVAC, Home audio appliances.

  - Adaptive real-time memory accelerator (ART)
  - LCD parallel interface, 8080/6800 modes
  - Multi-layer bus matrix
  - 5 V-tolerant I/Os
  - Timer with quadrature (incremental) encoder input
  - Parallel camera interface
  - Analog true random number generator
  - 96-bit unique ID
      </description>

