saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32F2xx_DFP.2.9.0.pdsc
          <variant Dvariant="STM32F215RETx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F215RG'  ***************************** -->
        <device Dname="STM32F215RG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>

          <variant Dvariant="STM32F215RGTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F215VE'  ***************************** -->
        <device Dname="STM32F215VE">
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <feature type="ExtBus"        n="16"/>

          <variant Dvariant="STM32F215VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F215VG'  ***************************** -->
        <device Dname="STM32F215VG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <feature type="ExtBus"        n="16"/>

          <variant Dvariant="STM32F215VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F215ZE'  ***************************** -->
        <device Dname="STM32F215ZE">
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="ExtBus"        n="16"/>

          <variant Dvariant="STM32F215ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F215ZG'  ***************************** -->
        <device Dname="STM32F215ZG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="ExtBus"        n="16"/>

          <variant Dvariant="STM32F215ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F217'  **************************** -->
      <subFamily DsubFamily="STM32F217">
        <processor Dclock="120000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F2xx/Include/stm32f2xx.h"  define="STM32F217xx"/>
        <debug svd="CMSIS/SVD/STM32F21x.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F205_207_215_217.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <book name="Documentation/CD00225773.pdf" title="STM32F205/207/215/217 Reference Manual"/>
        <book name="Documentation/CD00263874.pdf" title="STM32F215/217 Data Sheet"/>
        <book name="Documentation/DM00027213.pdf" title="STM32F205/207/215/217 Errata Sheet"/>

        <feature type="I2C"           n="3"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="Crypto"        n="1"                           name="Hardware acceleration for AES 128, 192, 256, Triple DES, HASH (MD5, SHA-1)"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="Camera"        n="14"/>

        <!-- *************************  Device 'STM32F217VE'  ***************************** -->
        <device Dname="STM32F217VE">
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>

          <variant Dvariant="STM32F217VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

