saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32F2xx_DFP.2.9.0.pdsc
        <!-- *************************  Device 'STM32F217VG'  ***************************** -->
        <device Dname="STM32F217VG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>

          <variant Dvariant="STM32F217VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F217ZE'  ***************************** -->
        <device Dname="STM32F217ZE">
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>

          <variant Dvariant="STM32F217ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F217ZG'  ***************************** -->
        <device Dname="STM32F217ZG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>

          <variant Dvariant="STM32F217ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F217IE'  ***************************** -->
        <device Dname="STM32F217IE">
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>

          <variant Dvariant="STM32F217IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F217IEHx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F217IG'  ***************************** -->
        <device Dname="STM32F217IG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OPT.FLM"  start="0x1FFFC000" size="0x00000010"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F2xx_OTP.FLM"  start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>

          <variant Dvariant="STM32F217IGTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F217IGHx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>
    </family>
  </devices>

  <boards>
    <board vendor="Keil" name="MCBSTM32F200" revision="Ver 1.1" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCBSTM32F200=ON">
      <description>Keil MCBSTM32F200 Development Board</description>
      <image small="MDK/Boards/Keil/MCBSTM32F200/Documentation/mcbstm32f200_board_small.jpg" large="MDK/Boards/Keil/MCBSTM32F200/Documentation/mcbstm32f200_board_large.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcbstm32f200/" title="MCBSTM32F200 Evaluation Board Web Page"/>
      <book category="schematic" name="MDK/Boards/Keil/MCBSTM32F200/Documentation/mcbstm32f200-schematics.pdf" title="Schematics V1.1"/>
      <book category="schematic" name="MDK/Boards/Keil/MCBSTM32F200/Documentation/mcbstm32f200-schematics_V1.2.pdf" title="Schematics V1.2"/>
      <book category="manual"    name="MDK/Boards/Keil/MCBSTM32F200/Documentation/mcbstm32f200.chm" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F207IG"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F207"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F217"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F205"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F215"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="PWR"             n="8"  m="12"      name="External Supply"/>
      <feature type="RAM"             n="1"              name="2 MByte SRAM"/>
      <feature type="ROM"             n="1"              name="8 MByte NOR Flash"/>
      <feature type="ROM"             n="1"              name="512 MByte NAND Flash"/>
      <feature type="ROM"             n="1"              name="8 kByte I2C EEPROM"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed, Host/Device, OTG"/>
      <feature type="USB"             n="1"              name="USB 2.0 High Speed, Host/Device, OTG"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Gyro"            n="1"              name="3-axis digital output gyroscope"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Accelerometer"   n="1"              name="3-axis digital Accelerometer"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="LineIn"          n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"         n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="Other"           n="1"              name="Digital Microphone"/>
      <feature type="Camera"          n="1"              name="Digital VGA Camera"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Wakeup, Tamper and User"/>
      <feature type="LED"             n="8"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <conditions>
    <condition id="STM32F2">
      <description>STMicroelectronics STM32F2 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F2*"/>
    </condition>
    <condition id="STM32F205xx">
      <description>STMicroelectronics STM32F205xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F205*"/>
    </condition>
    <condition id="STM32F207xx">
      <description>STMicroelectronics STM32F207xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F207*"/>
    </condition>
    <condition id="STM32F215xx">
      <description>STMicroelectronics STM32F215xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F215*"/>
    </condition>
    <condition id="STM32F217xx">
      <description>STMicroelectronics STM32F217xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F217*"/>
    </condition>

    <condition id="STM32F2x5">
      <description>STMicroelectronics STM32F205/215 Series devices</description>
      <accept  condition="STM32F205xx"/>
      <accept  condition="STM32F215xx"/>
    </condition>
    <condition id="STM32F2x7">
      <description>STMicroelectronics STM32F207/217 Series devices</description>
      <accept  condition="STM32F207xx"/>
      <accept  condition="STM32F217xx"/>
    </condition>
    <condition id="STM32F21x">
      <description>STMicroelectronics STM32F215/217 Series devices</description>
      <accept  condition="STM32F215xx"/>
      <accept  condition="STM32F217xx"/>
    </condition>

    <condition id="STM32F2_ARMCC">
      <description>filter for STM32F2 devices and the ARM compiler</description>
      <require condition="STM32F2"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F205xx_ARMCC">
      <description>filter for STM32F205xx devices and the ARM compiler</description>
      <require condition="STM32F205xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F205xx_GCC">
      <description>filter for STM32F205xx devices and the GCC compiler</description>
      <require condition="STM32F205xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F205xx_IAR">
      <description>filter for STM32F205xx devices and the IAR compiler</description>
      <require condition="STM32F205xx"/>
      <require Tcompiler="IAR"/>
    </condition>

