saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32F2xx_DFP.2.9.0.pdsc
    <condition id="STM32F207xx_ARMCC">
      <description>filter for STM32F207xx devices and the ARM compiler</description>
      <require condition="STM32F207xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F207xx_GCC">
      <description>filter for STM32F207xx devices and the GCC compiler</description>
      <require condition="STM32F207xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F207xx_IAR">
      <description>filter for STM32F207xx devices and the IAR compiler</description>
      <require condition="STM32F207xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F215xx_ARMCC">
      <description>filter for STM32F215xx devices and the ARM compiler</description>
      <require condition="STM32F215xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F215xx_GCC">
      <description>filter for STM32F215xx devices and the GCC compiler</description>
      <require condition="STM32F215xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F215xx_IAR">
      <description>filter for STM32F215xx devices and the IAR compiler</description>
      <require condition="STM32F215xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F217xx_ARMCC">
      <description>filter for STM32F217xx devices and the ARM compiler</description>
      <require condition="STM32F217xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F217xx_GCC">
      <description>filter for STM32F217xx devices and the GCC compiler</description>
      <require condition="STM32F217xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F217xx_IAR">
      <description>filter for STM32F217xx devices and the IAR compiler</description>
      <require condition="STM32F217xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F2 CMSIS">
      <description>STMicroelectronics STM32F2 Device and CMSIS-CORE</description>
      <require condition="STM32F2"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
    </condition>
    <condition id="STM32F2 CMSIS RTOS">
      <description>STMicroelectronics STM32F2 Device and CMSIS-CORE with RTOS</description>
      <require condition="STM32F2"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="CMSIS"  Cgroup="RTOS"/>
    </condition>
    <condition id="STM32F2 CMSIS RTOS I2C_Driver">
      <description>STMicroelectronics STM32F2 Device and CMSIS-CORE with RTOS and I2C Driver</description>
      <require condition="STM32F2"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <accept  Cclass="CMSIS" Cgroup="RTOS"/>
      <accept  Cclass="CMSIS" Cgroup="RTOS2"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>
    <condition id="STM32F2 CMSIS I2C_Driver">
      <description>STMicroelectronics STM32F2 Device and CMSIS-CORE with I2C Driver</description>
      <require condition="STM32F2"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>
    <condition id="STM32F2 CMSIS HAL">
      <description>STMicroelectronics STM32F2 Device and CMSIS-CORE with HAL</description>
      <require condition="STM32F2"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>

    <condition id="STM32F2 Framework Classic">
      <description>STM32CubeF2 Classic Framework</description>
      <require condition="STM32F2 HAL Common"/>
    </condition>

    <condition id="STM32F2 HAL Common">
      <description>STMicroelectronics STM32F2 Device and HAL Common</description>
      <require condition="STM32F2"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
    </condition>

    <condition id="STM32F2 HAL">
      <description>STMicroelectronics STM32F2 Device and HAL</description>
      <require condition="STM32F2"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F2x7 HAL">
      <description>STMicroelectronics STM32F207/217 Device and HAL</description>
      <require condition="STM32F2x7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>

    <condition id="STM32F2 HAL GPIO">
      <description>STMicroelectronics STM32F2 Device and HAL with GPIO</description>
      <require condition="STM32F2"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>
    <condition id="STM32F2 HAL GPIO ADC">
      <description>STMicroelectronics STM32F2 Device and HAL with GPIO and ADC</description>
      <require condition="STM32F2"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"/>
    </condition>
    <condition id="STM32F2 HAL GPIO SRAM">
      <description>STMicroelectronics STM32F2 Device and HAL with GPIO and SRAM</description>
      <require condition="STM32F2"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
    </condition>

    <condition id="STM32F2 HAL DMA">
      <description>STMicroelectronics STM32F2 Device and HAL with DMA</description>
      <require condition="STM32F2"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F2x7 HAL DMA">
      <description>STMicroelectronics STM32F207/217 Device and HAL with DMA</description>
      <require condition="STM32F2x7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F21x HAL DMA">
      <description>STMicroelectronics STM32F215/217 Device and HAL with DMA</description>
      <require condition="STM32F21x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F2 HAL DMA RCC">
      <description>STMicroelectronics STM32F2 Device and HAL with DMA and RCC</description>
      <require condition="STM32F2"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
    </condition>
