saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32F2xx_DFP.2.9.0.pdsc
    <!-- START: STMicroelectronics STM32CubeF2 HAL -->

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"    Cversion="1.2.1" condition="STM32F2 HAL Common">
      <description>Common HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMMON
      </RTE_Components_h>
      <files>
        <file category="include" name="Drivers/STM32F2xx_HAL_Driver/Inc/"/>
        <file category="header"  name="Drivers/STM32F2xx_HAL_Driver/Inc/stm32f2xx_hal.h"/>
        <file category="source"  name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"       Cversion="1.2.1" condition="STM32F2 HAL DMA">
      <description>Analog-to-digital converter (ADC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ADC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_adc.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_adc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CAN"       Cversion="1.2.1" condition="STM32F2 HAL">
      <description>Controller area network (CAN) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CAN
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_can.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"    Cversion="1.2.1" condition="STM32F2 HAL">
      <description>Cortex HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CORTEX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_cortex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRC"       Cversion="1.2.1" condition="STM32F2 HAL">
      <description>CRC calculation unit (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_crc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRYP"      Cversion="1.2.1" condition="STM32F21x HAL DMA">
      <description>Cryptographic processor (CRYP) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRYP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_cryp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DAC"       Cversion="1.2.1" condition="STM32F2 HAL DMA">
      <description>Digital-to-analog converter (DAC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DAC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_dac.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_dac_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI"      Cversion="1.2.1" condition="STM32F2x7 HAL DMA">
      <description>Digital camera interface (DCMI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DCMI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_dcmi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"       Cversion="1.2.1" condition="STM32F2 HAL">
      <description>DMA controller (DMA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_dma.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_dma_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ETH"       Cversion="1.2.1" condition="STM32F2x7 HAL RCC">
      <description>Ethernet MAC (ETH) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ETH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_eth.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Flash"     Cversion="1.2.1" condition="STM32F2 HAL">
      <description>Embedded Flash memory HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_flash.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_flash_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"      Cversion="1.2.1" condition="STM32F2 HAL">
      <description>General-purpose I/O (GPIO) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GPIO
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HASH"      Cversion="1.2.1" condition="STM32F21x HAL DMA">
      <description>Hash processor (HASH) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_hash.c"/>
      </files>
    </component>
