saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32F2xx_DFP.2.9.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HCD"       Cversion="1.2.1" condition="STM32F2 HAL">
      <description>USB Host controller (HCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_hcd.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_ll_usb.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"       Cversion="1.2.1" condition="STM32F2 HAL DMA RCC">
      <description>Inter-integrated circuit (I2C) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_i2c.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2S"       Cversion="1.2.1" condition="STM32F2 HAL DMA">
      <description>I2S HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2S
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_i2s.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IRDA"      Cversion="1.2.1" condition="STM32F2 HAL DMA RCC">
      <description>IrDA HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IRDA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_irda.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IWDG"      Cversion="1.2.1" condition="STM32F2 HAL">
      <description>Independent watchdog (IWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_iwdg.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="MMC"       Cversion="1.2.1" condition="STM32F2 HAL">
      <description>Multi Media Card (MMC) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MMC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_mmc.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_ll_sdmmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="NAND"      Cversion="1.2.1" condition="STM32F2 HAL">
      <description>NAND Flash controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_NAND
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_nand.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_ll_fsmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"       Cversion="1.2.1" condition="STM32F2 HAL">
      <description>NOR Flash controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_NOR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_nor.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_ll_fsmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PC Card"   Cversion="1.2.1" condition="STM32F2 HAL">
      <description>PC Card controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PCCARD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_pccard.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_ll_fsmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PCD"       Cversion="1.2.1" condition="STM32F2 HAL">
      <description>USB Peripheral controller (PCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_pcd.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_pcd_ex.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_ll_usb.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"       Cversion="1.2.1" condition="STM32F2 HAL">
      <description>Power controller (PWR) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PWR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_pwr.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_pwr_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"       Cversion="1.2.1" condition="STM32F2 HAL GPIO">
      <description>Reset and clock control (RCC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RCC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_rcc.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_rcc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RNG"       Cversion="1.2.1" condition="STM32F2 HAL">
      <description>Random number generator (RNG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RNG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_rng.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RTC"       Cversion="1.2.1" condition="STM32F2 HAL">
      <description>Real-time clock (RTC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RTC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_rtc.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_rtc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"        Cversion="1.2.1" condition="STM32F2 HAL">
      <description>Secure digital (SD) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_sd.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_ll_sdmmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Smartcard" Cversion="1.2.1" condition="STM32F2 HAL DMA RCC">
      <description>Smartcard HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SMARTCARD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_smartcard.c"/>
      </files>
    </component>
